tutorial/wfoamMooring/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-6.0 -0.3725 -0.6)
    ( 7.0 -0.3725 -0.6)
    ( 7.0  0.3725 -0.6)
    (-6.0  0.3725 -0.6)
    (-6.0 -0.3725  0.3)
    ( 7.0 -0.3725  0.3)
    ( 7.0  0.3725  0.3)
    (-6.0  0.3725  0.3)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1046 1 90) simpleGrading // (1 1 1)
    (
        (
            (10 1000 1 ) 
            ( 3  46  20)
        )
        1
        1
    )
);

edges
(
);

boundary
(
    // Dummy patch to trigger overset interpolation before any other bcs
    oversetPatch
    {
        type overset;
        faces ();
    }
    stationaryWalls
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    sidePatch
    {
        type empty;
        faces
        (
            (1 5 4 0) // front
            (3 7 6 2) // back
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
